# Load Libraries/Data

In [1]:
## Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
## Importing the OS and JSON Modules
import os,json

from sqlalchemy.types import *
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

import warnings
warnings.filterwarnings('ignore')

In [2]:
df_basics = pd.read_csv('Data/title_basics.csv.gz')
df_basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013.0,NaN,120,"Drama,History"

In [3]:
df_ratings = pd.read_csv('Data/title_ratings.csv.gz')
df_ratings.head(2)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265

In [4]:
df_tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
df_tmdb.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN

# Selecting Columns

## title_basics
- Movie ID (tconst)
- Primary Title
- Start Year
- Runtime (in Minutes)
- Genres

In [5]:
df_basics = df_basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes',
                      'genres']]
df_basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History"

## tmdb_results
- Movie ID
- Revenue
- Budget
- Certification (MPAA Rating)

In [6]:
df_tmdb = df_tmdb[['imdb_id', 'budget', 'revenue', 'certification']]
df_tmdb

        imdb_id      budget     revenue certification
0             0         NaN         NaN           NaN
1     tt0113026  10000000.0         0.0           NaN
2     tt0113092         0.0         0.0           NaN
3     tt0116391         0.0         0.0           NaN
4     tt0118694    150000.0  14204632.0            PG
...         ...         ...         ...           ...
2585  tt7797790         0.0         0.0           NaN
2586  tt8665056         0.0         0.0           NaN
2587  tt8795764         0.0         0.0            NR
2588  tt9071078         0.0         0.0           NaN
2589  tt9212730         0.0         0.0           NaN

[2590 rows x 4 columns]

### Remove Empty Rows

In [7]:
df_tmdb.drop(0, axis = 'index', inplace=True)

In [8]:
df_tmdb[df_tmdb['imdb_id'] == '0']

     imdb_id  budget  revenue certification
1249       0     NaN      NaN           NaN

In [9]:
df_tmdb.drop(1249, axis='index', inplace=True)

In [10]:
df_tmdb[df_tmdb['imdb_id'] == '0']

Empty DataFrame
Columns: [imdb_id, budget, revenue, certification]
Index: []

In [11]:
df_tmdb.reset_index(drop=True).head(2)

     imdb_id      budget  revenue certification
0  tt0113026  10000000.0      0.0           NaN
1  tt0113092         0.0      0.0           NaN

# Normalizing title_basics 'genres'

## List of Unique Genres

In [12]:
## create a col with a list of genres
df_basics['genres_split'] = df_basics['genres'].str.split(',')
df_basics.head(2)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History","[Drama, History]"

In [13]:
exploded_genres = df_basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",Drama
1,tt0043139,Life of a Beijing Policeman,2013.0,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Action
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Adventure
81827,tt9916190,Safeguard,2020.0,NaN,95,"Action,Adventure,Thriller",Thriller
81828,tt9916362,Coven,2020.0,NaN,92,"Drama,History",Drama
81828,tt9916362,Coven,2020.0,NaN,92,"Drama,History",History

In [14]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

## Create 'title_genres' Table

In [15]:
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

## Genre Mapper Dict

In [16]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [17]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [18]:
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0043139         7
1      tt0043139        11
...          ...       ...
81827  tt9916190         0
81827  tt9916190         2
81827  tt9916190        22
81828  tt9916362         7
81828  tt9916362        11

[153331 rows x 2 columns]

In [19]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_ID': genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

# Saving as MySQL Tables with Primary Keys

## Establish Connection to MySQL

In [20]:
with open('/Users/jonnu/.secret/mysql.json') as f: #change the path to match YOUR path!!
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [21]:
connection_str = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"

In [22]:
engine = create_engine(connection_str)

In [23]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

## 'title_basics' Create Schema and Add to MySQL

In [24]:
df_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81829 entries, 0 to 81828
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81829 non-null  object
 1   primaryTitle    81829 non-null  object
 2   startYear       81829 non-null  float64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81829 non-null  int64
 5   genres          81829 non-null  object
 6   genres_split    81829 non-null  object
dtypes: float64(2), int64(1), object(4)
memory usage: 4.4+ MB

In [25]:
## Calculate max string lengths for object columns
key_len = df_basics['tconst'].fillna('').map(len).max()
title_len = df_basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

### Drop Unnecessary Columns

In [26]:
df_basics = df_basics[['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes']]
df_basics.head(2)

      tconst                 primaryTitle  startYear  endYear  runtimeMinutes
0  tt0035423               Kate & Leopold     2001.0      NaN             118
1  tt0043139  Life of a Beijing Policeman     2013.0      NaN             120

In [27]:
# Save to sql with dtype and index=False
df_basics.to_sql('title_basics',
                 engine,
                 dtype=df_basics_schema,
                 if_exists='replace', index=False)

81829

In [28]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [29]:
q_basics = """

SELECT *
FROM title_basics
LIMIT 5;

"""

pd.read_sql(q_basics, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0043139,Life of a Beijing Policeman,2013.0,None,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
3,tt0069049,The Other Side of the Wind,2018.0,None,122
4,tt0088751,The Naked Monster,2005.0,None,100

## 'title_ratings' Create Schema and Add to MySQL

In [30]:
df_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502484 entries, 0 to 502483
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502484 non-null  object
 1   averageRating  502484 non-null  float64
 2   numVotes       502484 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [31]:
## Calculate max string lengths for object columns
key_len = df_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_ratings_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [32]:
# Save to sql with dtype and index=False
df_ratings.to_sql('title_ratings',
                 engine,
                 dtype=df_ratings_schema,
                 if_exists='replace', index=False)

502484

In [33]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [34]:
q_ratings = """

SELECT *
FROM title_ratings
LIMIT 5;

"""

pd.read_sql(q_ratings, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2624
3  tt0000006            5.1       182
4  tt0000007            5.4       821

## 'title_genres' Create Schema and Add to MySQL

In [35]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153331 entries, 0 to 81828
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153331 non-null  object
 1   genre_id  153331 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [36]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_title_genres_schema = {
    "tconst": String(key_len+1),
    'genre_id':Integer()}

In [37]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',
                 engine,
                 dtype=df_title_genres_schema,
                 if_exists='replace', index=False)

153331

In [38]:
q_title_genres = """

SELECT *
FROM title_genres
LIMIT 5;

"""

pd.read_sql(q_title_genres, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0043139         7
4  tt0043139        11

## 'genres' Create Schema and Add to MySQL

In [39]:
genre_lookup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  25 non-null     object
 1   Genre_ID    25 non-null     int64
dtypes: int64(1), object(1)
memory usage: 528.0+ bytes

In [40]:
genre_lookup = genre_lookup[['Genre_ID', 'Genre_Name']]
genre_lookup.head(1)

   Genre_ID Genre_Name
0         0     Action

In [41]:
## Calculate max string lengths for object columns
text_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_genres_schema = {
    'Genre_ID':Integer(),
    "Genre_Name": Text(key_len+1)
    }

In [42]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres',
                 engine,
                 dtype=df_genres_schema,
                 if_exists='replace', index=False)

25

In [43]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [44]:
q_genres = """

SELECT *
FROM genres
LIMIT 5;

"""

pd.read_sql(q_genres, engine)

   Genre_ID Genre_Name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

## 'tmdb_data' Create Schema and Add to MySQL

In [45]:
df_tmdb.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2588 entries, 1 to 2589
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2588 non-null   object
 1   budget         2588 non-null   float64
 2   revenue        2588 non-null   float64
 3   certification  813 non-null    object
dtypes: float64(2), object(2)
memory usage: 101.1+ KB

In [46]:
## Calculate max string lengths for object columns
key_len = df_tmdb['imdb_id'].fillna('').map(len).max()
title_len = df_tmdb['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_tmdb_schema = {
    "imdb_id": String(key_len+1), 
    "certification": Text(title_len+1),
    'budget':Float(),
    'revenue':Float()}

In [47]:
# Save to sql with dtype and index=False
df_tmdb.to_sql('tmdb_data',
                 engine,
                 dtype=df_tmdb_schema,
                 if_exists='replace', index=False)

2588

In [48]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [49]:
q_tmdb = """

SELECT *
FROM tmdb_data
LIMIT 5;

"""

pd.read_sql(q_tmdb, engine)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0113026  10000000.0         0.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

# Show Tables Query

In [50]:
q = """

SHOW TABLES;

"""

pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data